-- Этап 1. Создание и заполнение БД



-- Этап 2. Создание выборок

---- Задание 1. Напишите запрос, который выведет процент моделей машин, у которых нет параметра `gasoline_consumption`.



---- Задание 2. Напишите запрос, который покажет название бренда и среднюю цену его автомобилей в разбивке по всем годам с учётом скидки.



---- Задание 3. Посчитайте среднюю цену всех автомобилей с разбивкой по месяцам в 2022 году с учётом скидки.



---- Задание 4. Напишите запрос, который выведет список купленных машин у каждого пользователя.



---- Задание 5. Напишите запрос, который покажет количество всех пользователей из США.




